#define _CRT_SECURE_NO_WARNINGS
#include <conio.h> // Подключаем заголовочный файл с описанием функции getch
#include <stdio.h> // Подключаем заголовочный файл с описанием функции printf
#include <locale.h> // Подключаем заголовочный файл с описанием функции setlocale

/* Лабораторная работа № 1, Вариант 13;
   Макарова Полина, 2 курс, гр. ПМИ-2 */

   /* Вариант 13 >
	  Формула 1 : x *= y + z
	  Формула 2 : x = x / y || x / z */

int main() // Главная функция
{
	setlocale(LC_ALL, "Russian"); // Смена кодировки
	int x1, y1, z1, x2, y2, z2, x3, y3, z3; // Объявление переменных
	int i; // i – параметр цикла

	printf("1) Введите последовательно целые числа x, y, z: \n");
	scanf("%d %d %d", &x1, &y1, &z1); // Ввод информации с клавиатуры
	//printf("x = %d, y = %d, z = %d", A[1][i], A[2][i], A[3][i]); // Вывод на экран
	while (getchar() != '\n');
	printf("2) Введите последовательно целые числа x, y, z: \n");
	scanf("%d %d %d", &x2, &y2, &z2);
	while (getchar() != '\n');
	printf("3) Введите последовательно целые числа x, y, z: \n");
	scanf("%d %d %d", &x3, &y3, &z3);

	printf("\n");

	//Создание таблицы
	printf(" |-------|-------|-------|------------|--------------------|\n");
	printf(" |   x   |   y   |   z   | x *= y + z | x = x / y || x / z |\n");
	printf(" |-------|-------|-------|------------|--------------------|\n");
	printf(" |%7d|%7d|%7d|%11d | %18d |\n", x1, y1, z1, (y1 + z1) * x1, x1 / y1 || x1 / z1);
	printf(" |-------|-------|-------|------------|--------------------|\n");
	printf(" |%7d|%7d|%7d|%11d | %18d |\n", x2, y2, z2, (y2 + z2) * x2, x2 / y2 || x2 / z2);
	printf(" |-------|-------|-------|------------|--------------------|\n");
	printf(" |%7d|%7d|%7d|%11d | %18d |\n", x3, y3, z3, (y3 + z3) * x3, x3 / y3 || x3 / z3);
	printf(" |-------|-------|-------|------------|--------------------|\n");

	float fx1, fy1, fz1, fx2, fy2, fz2, fx3, fy3, fz3;
	//float k = 1 + 13 % 5; // k = 4
	//printf("%f", k);
	while (getchar() != '\n');
	printf("1) Введите последовательно вещественные числа x, y, z: \n");
	scanf("%f %f %f", &fx1, &fy1, &fz1); // Ввод информации с клавиатуры
	while (getchar() != '\n');
	printf("2) Введите последовательно вещественные числа x, y, z: \n");
	scanf("%f %f %f", &fx2, &fy2, &fz2);
	while (getchar() != '\n');
	printf("3) Введите последовательно вещественные числа x, y, z: \n");
	scanf("%f %f %f", &fx3, &fy3, &fz3);

	printf(" |-------|-------|-------|------------|\n");
	printf(" |   x   |   y   |   z   | x *= y + z |\n");
	printf(" |-------|-------|-------|------------|\n");
	printf(" |%7.4f|%7.4f|%7.4f|%11.4f |\n", fx1, fy1, fz1, (fy1 + fz1) * fx1);
	printf(" |-------|-------|-------|------------|\n");
	printf(" |%7.4f|%7.4f|%7.4f|%11.4f |\n", fx2, fy2, fz2, (fy2 + fz2) * fx2);
	printf(" |-------|-------|-------|------------|\n");
	printf(" |%7.4f|%7.4f|%7.4f|%11.4f |\n", fx3, fy3, fz3, (fy3 + fz3) * fx3);
	printf(" |-------|-------|-------|------------|\n");
}